# Brewfile — optional macOS package baseline. Applied only on demand:
#   brew bundle --file ~/dotfiles/packages/Brewfile
# (bootstrap.sh --packages runs this for you.) Keep in sync with packages/apt.txt.

# Core CLI / dev tooling referenced by the shell config
brew "git"
brew "gh"
brew "bash"
brew "bash-completion@2"
brew "uv"
brew "node"
brew "pnpm"
brew "pipx"
brew "direnv"
brew "git-delta"     # `delta` — git pager set in gitconfig
brew "jq"
brew "vim"
brew "nvm"
brew "pyenv"
brew "gnu-sed"
brew "coreutils"     # provides gtimeout (used by the sync engine)
cask "zed"
